'''
딕셔너리
 {}

저장방법
변수명={key:value}

key 자료형 확인
 중복X, 변경될 수 있는 자료형X
 정수, 문자열, 실수, 튜플 O

value 자료형 확인 
 지금까지 배운 자료형 몽땅!
 중복 데이터 허용.


[]리스트에 추가를 하려면 함수?

딕셔너리 함수를 사용하지 않아도
 변수명[key]=value
  --> 추가, 수정, 변경하는 기능!

딕셔너리 삭제
del 변수명[key]

key를 이용해서 value 확인
변수명[key]

딕셔너리 함수
keys() : key값만 따로 뽑아주는 함수
values(): 값만 따로 뽑아주는 함수.

접근해서 사용하려면 list형태로 형을 변환해서 사용해야된다.

stulist에 철수가 있니?
in
>>> stulist={'철수':'202-333','영희':'22=11111',}
>>> '철수' in stulist
True

key가 딕셔너리안에 있는 지 검사하는 명령어. 

데이터가 있으면 true
데이터가 없으면 false

-------------------------------------------------------------

제어문
 원하는 결과를 얻을때까지 어떤 조건이나 반복을 하는 명령문 모임. 

조건문 if
반복문 for, while

if 조건식:
    참인경우 실행하는 문장
    참인경우 실행하는 문장

들여쓰기 : 범위지정
{}범위지정으로 하지 않는다.

점수를 입력받아서 60점 이상이면 합격 







